In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([[1.4, np.nan], [7.1,-4.5], [np.nan, np.nan], [0.75, -1.3]], index = ['a','b','c','d'], columns = ['one','two'])

In [3]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [4]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [6]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [7]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [9]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [8]:
df.idxmax()

one    b
two    d
dtype: object

In [10]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [11]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [12]:
obj = pd.Series(['a','a','b','c']*4)

In [13]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [14]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

## Correlation and Covariance

In [15]:
import pandas_datareader as web

In [16]:
all_data = {ticker: web.get_data_yahoo(ticker) for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [18]:
price = pd.DataFrame({ticker: data['Adj Close'] for ticker, data in all_data.items()})

In [21]:
volume = pd.DataFrame({ticker: data['Volume'] for ticker, data in all_data.items()})

In [22]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2016-08-01   24.767578  129.272690   52.124783   772.880005
2016-08-02   24.400913  128.576111   52.124783   771.070007
2016-08-03   24.706854  128.648148   52.484077   773.179993
2016-08-04   24.859488  129.352783   52.871002   771.609985
2016-08-05   25.237530  130.914124   53.396114   782.219971
...                ...         ...         ...          ...
2021-07-23  148.559998  141.339996  289.670013  2756.320068
2021-07-26  148.990005  142.770004  289.049988  2792.889893
2021-07-27  146.770004  142.750000  286.540009  2735.929932
2021-07-28  144.979996  141.770004  286.220001  2727.629883
2021-07-29  145.639999  141.929993  286.500000  2730.810059

[1258 rows x 4 columns]

In [23]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2016-08-01  152671600.0  2823600.0  26003400.0  2700500
2016-08-02  135266400.0  3080900.0  35122000.0  1784500
2016-08-03  120810400.0  2861700.0  22075600.0  1287400
2016-08-04  109634800.0  2489100.0  26587700.0  1140300
2016-08-05  162213600.0  3812400.0  29335200.0  1801200
...                 ...        ...         ...      ...
2021-07-23   71361600.0  4473300.0  22753500.0  1317200
2021-07-26   72269700.0  4244700.0  23154000.0  1150600
2021-07-27  103580300.0  3136600.0  32667900.0  2091200
2021-07-28  118931200.0  2543800.0  33566900.0  2734400
2021-07-29   56507100.0  2669000.0  18117200.0   961200

[1258 rows x 4 columns]

In [24]:
returns = price.pct_change()

In [26]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-07-23  0.011989  0.004477  0.012337  0.033657
2021-07-26  0.002895  0.010118 -0.002140  0.013268
2021-07-27 -0.014900 -0.000140 -0.008684 -0.020395
2021-07-28 -0.012196 -0.006865 -0.001117 -0.003034
2021-07-29  0.004552  0.001129  0.000978  0.001166

In [27]:
returns['MSFT'].corr(returns['IBM'])

0.5177855062113073

In [28]:
returns['MSFT'].cov(returns['IBM'])

0.00014529881868505842

In [29]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.440979  0.735457  0.662159
IBM   0.440979  1.000000  0.517786  0.484757
MSFT  0.735457  0.517786  1.000000  0.775999
GOOG  0.662159  0.484757  0.775999  1.000000

In [30]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000362  0.000137  0.000240  0.000212
IBM   0.000137  0.000268  0.000145  0.000133
MSFT  0.000240  0.000145  0.000294  0.000224
GOOG  0.000212  0.000133  0.000224  0.000283

In [31]:
returns.corrwith(returns.IBM)

AAPL    0.440979
IBM     1.000000
MSFT    0.517786
GOOG    0.484757
dtype: float64

## Unique Values, Values Counts, and Membership

In [32]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])

In [33]:
uniques = obj.unique()

In [34]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [35]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [36]:
pd.value_counts(obj.values, sort=False)

c    3
a    3
d    1
b    2
dtype: int64

In [37]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [38]:
mask = obj.isin(['b', 'c'])

In [39]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [40]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [41]:
to_match = pd.Series(['c','a','b','b','c','a'])

In [42]:
unique_val = pd.Series(['c','b','a'])

In [43]:
pd.Index(unique_val).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [44]:
data = pd.DataFrame({'Qu1':[1,3,4,3,4],'Qu2':[2,3,1,2,3],'Qu3':[1,5,2,4,4]})

In [45]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [46]:
result = data.apply(pd.value_counts).fillna(0)

In [47]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0